Documents/РанжированияБанковПоПроектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>РанжированияБанковПоПроектам</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроектыУПН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РанжированиеБанков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РанжированияБанковПоПроектам/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для каждого СтрокаТЧ Из ТекущийОбъект.РанжированиеБанков Цикл
		
		СтрокаТЧ.Порядок = СтрокаТЧ.НомерСтроки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборБанков(Команда)
	
	ПараметрыФормыПодбора = Новый Структура("УИДФормыВладельца", ЭтаФорма.УникальныйИдентификатор);
	ОткрытьФорму("Документ.РанжированияБанковПоПроектам.Форма.ФормаПодбораБанков", ПараметрыФормыПодбора, Элементы.РанжированиеБанков);
	
КонецПроцедуры

&НаКлиенте
Процедура РанжированиеБанковОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЭтоАдресВременногоХранилища(ВыбранноеЗначение) Тогда
		ЗагрузитьНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(Знач ВыбранноеЗначение)
		
	ТЗ_Банков = ПолучитьИзВременногоХранилища(ВыбранноеЗначение);
	
	Для каждого СтрокаТЗ Из ТЗ_Банков Цикл
		Если Объект.РанжированиеБанков.НайтиСтроки(Новый Структура("Банк", СтрокаТЗ.Банк)).Количество() > 0 Тогда
			Продолжить;	
		КонецЕсли;
		НоваяСтрока = Объект.РанжированиеБанков.Добавить();	
		НоваяСтрока.Банк = СтрокаТЗ.Банк;
	КонецЦикла;
	
КонецПроцедуры
